Repository: Mellaoui/yasmin
Catalog: lib/l10n/app_*.arb
Languages: ar

# metaDescription
source: The Yassmine app supports women in tracking their health, menstrual cycles, and pregnancy, offering personalized reminders and tips.
ar: تطبيق ياسمين يهدف إلى دعم النساء في تتبع صحتهم، دوراتهم الشهرية، وفترات الحمل، ويقدم تذكيرات ونصائح مخصصة.

# language
source: English
ar: العربية

# title
source: Yassmine
ar: ياسمين

source: Get Pregnant
ar: الحمل

source: Track Pregnancy
ar: تتبع الحمل

source: Start
ar: ابدأ

# pregnantModalMessage
source: You have started tracking your journey to get pregnant!
ar: لقد بدأت تتبع رحلتك للحمل!

# pregnancyModalMessage
source: You have started tracking your pregnancy!
ar: لقد بدأت تتبع حملك!

source: Track Cycle
ar: تتبع الدورة

source: Cycle Settings
ar: إعدادات الدورة

source: Reminders
ar: التذكيرات

source: Settings
ar: الإعدادات

source: Symptom Tracker
ar: متتبع الأعراض

source: Today
ar: اليوم

source: Calendar
ar: التقويم

source: Health
ar: الصحة

source: You
ar: أنت

source: Secret Box
ar: الصندوق السري

source: Prize Contest
ar: مسابقة الجوائز

source: School Days
ar: أيام المدرسة

source: BMI
ar: مؤشر كتلة الجسم

# notification
source: Notifications
ar: الإشعارات

source: Log Period
ar: سجل الدورة

source: Cycle Status
ar: حالة الدورة

source: High chance of conception
ar: فرصة عالية للحمل

source: Period
ar: الحيض

source: Ovulation
ar: الإباضة

source: Pre-period
ar: ما قبل الحيض

source: Pregnancy Progress
ar: تقدم الحمل

source: Trimester Tips
ar: نصائح الثلث

source: Doctor Visits
ar: زيارات الطبيب

source: Health Tracking
ar: تتبع الصحة

source: Fertile Window
ar: نافذة الخصوبة

source: Healthy Diet
ar: النظام الغذائي الصحي

source: Reduce Stress
ar: تقليل التوتر

# ovulationWindowMessage
source: Based on your cycle, you are most fertile from {startDate} to {endDate}.
ar: بناءً على دورتك، تكونين أكثر خصوبة من {startDate} إلى {endDate}.

# healthyDietTip
source: Ensure a healthy diet rich in folic acid, iron, and calcium to improve fertility.
ar: تأكدي من اتباع نظام غذائي غني بحمض الفوليك والحديد والكالسيوم لتحسين الخصوبة.

# reduceStressTip
source: Practice relaxation techniques like yoga or meditation to reduce stress.
ar: مارسي تقنيات الاسترخاء مثل اليوغا أو التأمل لتقليل التوتر.

source: Second Trimester Tips
ar: نصائح الثلث الثاني

# secondTrimesterTipsMessage
source: Focus on healthy eating, staying active, and preparing for the baby's arrival.
ar: ركزي على تناول الطعام الصحي، والحفاظ على النشاط، والاستعداد لوصول الطفل.

# doctorVisitsMessage
source: Ensure you are attending all scheduled prenatal visits and tracking baby growth.
ar: تأكدي من حضور جميع زيارات الطبيب المجدولة وتتبع نمو الطفل.

source: Choose Language
ar: اختر اللغة

# switchLanguageMessage
source: Switch the app language
ar: تبديل لغة التطبيق

source: Normal day
ar: يوم عادي

# logPeriodTitle
source: Log Period
ar: سجل الدورة

source: Start period today:
ar: ابدأ الدورة اليوم:

# periodLength
source: Period Length (days):
ar: مدة الدورة (أيام):

# selectStartDateError
source: Please select a start date for the period.
ar: يرجى تحديد تاريخ بدء الدورة.

# logPeriodButton
source: LOG PERIOD
ar: سجل الدورة

source: Track Symptoms
ar: تتبع الأعراض

source: Mood
ar: المزاج

source: Happy
ar: سعيد

source: Sad
ar: حزين

source: Cramp
ar: تقلصات

source: Tired
ar: متعب

source: Bleeding
ar: النزيف

source: Light Bleeding
ar: نزيف خفيف

source: Heavy Bleeding
ar: نزيف شديد

source: Symptoms
ar: الأعراض

source: Nausea
ar: غثيان

source: Headache
ar: صداع

source: Bloating
ar: انتفاخ

source: Cravings
ar: رغبات

source: Breasts Hurting
ar: ألم في الثدي

source: Lower Back Pain
ar: ألم أسفل الظهر

source: Sex
ar: الجنس

source: Protected Sex
ar: جنس محمي

source: Unprotected Sex
ar: جنس غير محمي

source: Pregnancy Test
ar: اختبار الحمل

source: Positive Test
ar: نتيجة إيجابية

source: Negative Test
ar: نتيجة سلبية

source: Save
ar: حفظ

# gameTitle
source: Mood Match
ar: مطابقة المزاج

source: Score
ar: النقاط

source: Time Left
ar: الوقت المتبقي

source: Next Level
ar: المستوى التالي

source: Congratulations!
ar: مبروك!

# completedLevel
source: You completed Level {level}!
ar: أكملت المستوى {level}!

source: Completed
ar: تم

source: Not completed
ar: غير مكتمل

# noPeriodData
source: No period data available
ar: لا توجد بيانات للدورة المتاحة

# gameOver
source: Time's up!
ar: انتهى الوقت!

source: High Score
ar: أعلى درجة

source: Try Again
ar: حاول مرة أخرى

source: Quit
ar: إنهاء

source: Back
ar: العودة

# question_anxiety
source: Anxiety
ar: قلق

# question_fatigue
source: Fatigue
ar: إرهاق

# question_irritability
source: Irritability
ar: تململ

# question_sadness
source: Sadness
ar: حزن

# question_cramps
source: Cramps
ar: تشنجات

# question_headache
source: Headache
ar: صداع

# question_loneliness
source: Loneliness
ar: وحدة

# question_stress
source: Stress
ar: ضغط

# question_moodSwings
source: Mood Swings
ar: تغيرات مزاجية

# question_tiredness
source: Tiredness
ar: تعب

# question_confusion
source: Confusion
ar: ارتباك

# question_fear
source: Fear
ar: خوف

# question_insomnia
source: Insomnia
ar: أرق

# question_lethargy
source: Lethargy
ar: خمول

# question_overwhelm
source: Overwhelm
ar: إرهاق

# question_distraction
source: Distraction
ar: تشتت

# question_boredom
source: Boredom
ar: ملل

# question_anger
source: Anger
ar: غضب

# question_frustration
source: Frustration
ar: إحباط

# question_impatience
source: Impatience
ar: نفاد الصبر

# question_restlessness
source: Restlessness
ar: قلق

# remedy_relaxation
source: Relaxation
ar: استرخاء

# remedy_snacks
source: Snacks
ar: وجبات خفيفة

# remedy_exercise
source: Exercise
ar: تمرين

# remedy_socializing
source: Socializing
ar: التواصل الاجتماعي

# remedy_heatTherapy
source: Heat Therapy
ar: العلاج بالحرارة

# remedy_hydration
source: Hydration
ar: ترطيب

# remedy_connectWithFriends
source: Connecting with Friends
ar: التواصل مع الأصدقاء

# remedy_meditation
source: Meditation
ar: تأمل

# remedy_healthySnacks
source: Healthy Snacks
ar: وجبات خفيفة صحية

# remedy_mindfulBreathing
source: Mindful Breathing
ar: تنفس يقظ

# remedy_comfortActivity
source: Comfort Activity
ar: نشاط مريح

# remedy_sleepHygiene
source: Sleep Hygiene
ar: نظافة النوم

# remedy_movement
source: Movement
ar: حركة

# remedy_planning
source: Planning
ar: تخطيط

# remedy_focusExercise
source: Focus Exercise
ar: تمرين تركيز

# remedy_newActivity
source: New Activity
ar: نشاط جديد

# remedy_breathingExercises
source: Breathing Exercises
ar: تمارين التنفس

# remedy_journaling
source: Journaling
ar: كتابة يوميات

# remedy_mindfulness
source: Mindfulness
ar: يقظة ذهنية

# remedy_physicalActivity
source: Physical Activity
ar: نشاط بدني

# profileTitle
source: Profile
ar: الملف الشخصي

# completionText
source: {percentage}% Complete
ar: اكتمل بنسبة {percentage}%

# ageLabel
source: Age
ar: العمر

# interestsLabel
source: Interests
ar: الاهتمامات

# editButton
source: Edit
ar: تعديل

# mediaCompleteLabel
source: Media Completed
ar: تم إكمال الوسائط

source: Not set
ar: غير محدد

# saveButton
source: Save
ar: حفظ

# nameLabel
source: Name
ar: الاسم

# finalizePeriodTitle
source: Finalize Period
ar: إتمام الدورة

# finalizePeriodButton
source: Finalize Period
ar: إتمام الدورة

# periodFinalized
source: Your period has been successfully finalized.
ar: تم إتمام الدورة بنجاح.

source: Selected Start Date
ar: تاريخ البدء المحدد

# selectStartDatePrompt
source: Please select the start date
ar: يرجى اختيار تاريخ البدء

# ovulationPrediction
source: Predicted Ovulation Date
ar: تاريخ التبويض المتوقع

# bmi_calculator_title
source: BMI Calculator
ar: حاسبة مؤشر كتلة الجسم

# gender_label
source: Gender:
ar: الجنس:

source: Female
ar: أنثى

source: Male
ar: ذكر

# height_label
source: Height
ar: الطول

# weight_label
source: Weight
ar: الوزن

# cm_unit
source: cm
ar: سم

# kg_unit
source: kg
ar: كجم

# calculate_button
source: Calculate!
ar: احسب!

source: Your BMI Result
ar: نتيجة مؤشر كتلة الجسم

# bmi_category
source: Category
ar: الفئة

source: Underweight
ar: نقص الوزن

source: Healthy
ar: صحي

source: Overweight
ar: زيادة الوزن

source: Obese
ar: سمنة

source: Highly Obese
ar: سمنة مفرطة

source: Extremely Obese
ar: سمنة شديدة

# bmi_categories_label
source: BMI Categories:
ar: فئات مؤشر كتلة الجسم:

# results_button
source: Results
ar: النتائج

source: Logout
ar: تسجيل الخروج

source: login
ar: تسجيل الدخول

# title_tic_tac
source: Tic-Tac-Toe
ar: لعبة تيك تاك تو

# player_wins
source: Player {player} Wins!
ar: اللاعب {player} فاز!

# draw
source: It's a Draw!
ar: انتهت بالتعادل!

# reset_button
source: Reset Game
ar: إعادة اللعبة

source: Login Required
ar: مطلوب تسجيل الدخول
